
********************************************************************
  すべての列を出力する
********************************************************************

SELECT *
  FROM Shohin;

 shohin_id |   shohin_mei   | shohin_bunrui | hanbai_tanka | shiire_tanka |  torokubi
-----------+----------------+---------------+--------------+--------------+------------
 0001      | Tシャツ        | 衣服          |         1000 |          500 | 2009-09-20
 0002      | 穴あけパンチ   | 事務用品      |          500 |          320 | 2009-09-11
 0003      | カッターシャツ | 衣服          |         4000 |         2800 |
 0004      | 包丁           | キッチン用品  |         3000 |         2800 | 2009-09-20
 0005      | 圧力鍋         | キッチン用品  |         6800 |         5000 | 2009-01-15
 0006      | フォーク       | キッチン用品  |          500 |              | 2009-09-20
 0007      | おろしがね     | キッチン用品  |          880 |          790 | 2008-04-28
 0008      | ボールペン     | 事務用品      |          100 |              | 2009-11-11
(8 行)

********************************************************************
  RANK関数
********************************************************************

--------------------------------------------------------------------
  商品分類別に販売単価の安い順で並べたランキングを求める
--------------------------------------------------------------------

  SELECT shohin_mei, shohin_bunrui, hanbai_tanka,
        RANK () OVER (PARTITION BY shohin_bunrui
                          ORDER BY hanbai_tanka) AS ranking
    FROM Shohin;

    shohin_mei   | shohin_bunrui | hanbai_tanka | ranking
  ----------------+---------------+--------------+---------
  フォーク       | キッチン用品  |          500 |       1
  おろしがね     | キッチン用品  |          880 |       2
  包丁           | キッチン用品  |         3000 |       3
  圧力鍋         | キッチン用品  |         6800 |       4
  ボールペン     | 事務用品      |          100 |       1
  穴あけパンチ   | 事務用品      |          500 |       2
  Tシャツ        | 衣服          |         1000 |       1
  カッターシャツ | 衣服          |         4000 |       2
  (8 行)

--------------------------------------------------------------------
  PARTITION BY を指定しない場合
--------------------------------------------------------------------
 
  SELECT shohin_mei, shohin_bunrui, hanbai_tanka,
        RANK () OVER (ORDER BY hanbai_tanka) AS ranking
    FROM Shohin;

    shohin_mei   | shohin_bunrui | hanbai_tanka | ranking
  ----------------+---------------+--------------+---------
  ボールペン     | 事務用品      |          100 |       1
  フォーク       | キッチン用品  |          500 |       2
  穴あけパンチ   | 事務用品      |          500 |       2
  おろしがね     | キッチン用品  |          880 |       4
  Tシャツ        | 衣服          |         1000 |       5
  包丁           | キッチン用品  |         3000 |       6
  カッターシャツ | 衣服          |         4000 |       7
  圧力鍋         | キッチン用品  |         6800 |       8
  (8 行)

--------------------------------------------------------------------
  RANK, DENSE_RANK ,ROW_NUMBER の比較
--------------------------------------------------------------------
 
  SELECT shohin_mei, shohin_bunrui, hanbai_tanka,
        RANK () OVER (ORDER BY hanbai_tanka) AS ranking,
        DENSE_RANK () OVER (ORDER BY hanbai_tanka) AS dense_ranking,
        ROW_NUMBER () OVER (ORDER BY hanbai_tanka) AS row_num
    FROM Shohin;

   shohin_mei   | shohin_bunrui | hanbai_tanka | ranking | dense_ranking | row_num
----------------+---------------+--------------+---------+---------------+---------
 ボールペン     | 事務用品      |          100 |       1 |             1 |       1
 フォーク       | キッチン用品  |          500 |       2 |             2 |       2
 穴あけパンチ   | 事務用品      |          500 |       2 |             2 |       3
 おろしがね     | キッチン用品  |          880 |       4 |             3 |       4
 Tシャツ        | 衣服          |         1000 |       5 |             4 |       5
 包丁           | キッチン用品  |         3000 |       6 |             5 |       6
 カッターシャツ | 衣服          |         4000 |       7 |             6 |       7
 圧力鍋         | キッチン用品  |         6800 |       8 |             7 |       8
(8 行)

--------------------------------------------------------------------
  SUM関数をウィンドウ関数として使う
--------------------------------------------------------------------

SELECT shohin_id, shohin_mei, hanbai_tanka,
       SUM (hanbai_tanka) OVER (ORDER BY shohin_id) AS current_sum
  FROM Shohin;

 shohin_id |   shohin_mei   | hanbai_tanka | current_sum
-----------+----------------+--------------+-------------
 0001      | Tシャツ        |         1000 |        1000　　　←1000
 0002      | 穴あけパンチ   |          500 |        1500　　　←1000+500
 0003      | カッターシャツ |         4000 |        5500　　　←1000+500+4000
 0004      | 包丁           |         3000 |        8500　　　←1000+500+4000+3000
 0005      | 圧力鍋         |         6800 |       15300
 0006      | フォーク       |          500 |       15800
 0007      | おろしがね     |          880 |       16680
 0008      | ボールペン     |          100 |       16780
(8 行)

--------------------------------------------------------------------
  移動平均を算出する(集計対象のレコードを直近の3行にする)
--------------------------------------------------------------------

SELECT shohin_id, shohin_mei, hanbai_tanka,
       AVG (hanbai_tanka) OVER (ORDER BY shohin_id
                                ROWS 2 PRECEDING) AS moving_avg
  FROM Shohin;

 shohin_id |   shohin_mei   | hanbai_tanka |      moving_avg
-----------+----------------+--------------+-----------------------
 0001      | Tシャツ        |         1000 | 1000.0000000000000000　　←1000/1
 0002      | 穴あけパンチ   |          500 |  750.000000000000000011　　←1000+500/2
 0003      | カッターシャツ |         4000 | 1833.3333333333333333　　←1000+500+4000/3
 0004      | 包丁           |         3000 | 2500.0000000000000000　　←500+4000+3000/3
 0005      | 圧力鍋         |         6800 | 4600.0000000000000000　　←4000+3000+6800/3
 0006      | フォーク       |          500 | 3433.3333333333333333
 0007      | おろしがね     |          880 | 2726.6666666666666667
 0008      | ボールペン     |          100 |  493.3333333333333333
(8 行)

--------------------------------------------------------------------
  カレントレコードの前後の行を集計対象に含める
--------------------------------------------------------------------

SELECT shohin_id, shohin_mei, hanbai_tanka,
       AVG (hanbai_tanka) OVER (ORDER BY shohin_id
                                 ROWS BETWEEN 1 PRECEDING AND 
                                              1 FOLLOWING) AS moving_avg
  FROM Shohin;

 shohin_id |   shohin_mei   | hanbai_tanka |      moving_avg
-----------+----------------+--------------+-----------------------
 0001      | Tシャツ        |         1000 |  750.0000000000000000　　←1000+500/2
 0002      | 穴あけパンチ   |          500 | 1833.3333333333333333　　←1000+500+4000/3
 0003      | カッターシャツ |         4000 | 2500.0000000000000000　　←500+4000+3000/3
 0004      | 包丁           |         3000 | 4600.0000000000000000　　←4000+3000+6800/3
 0005      | 圧力鍋         |         6800 | 3433.3333333333333333
 0006      | フォーク       |          500 | 2726.6666666666666667
 0007      | おろしがね     |          880 |  493.3333333333333333
 0008      | ボールペン     |          100 |  490.0000000000000000
(8 行)


